// Задача 6
Console.Clear();
Console.Write("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
if(a % 2 == 0){
    Console.WriteLine("Число чётное = " + a);
}else Console.WriteLine("Число нечётное = " + a);
Console.WriteLine();
